Autodesk.Revit.DB.CustomFieldValue.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CustomFieldValue.ValueComputationResult
Identifies the result of the computation of the value.
The default value stored by this class is CustomFieldValueComputaionResult.ItemsDontHaveValue.

Autodesk.Revit.DB.CustomFieldValue.IntegerFieldValue
Identifies a computed value for the schedule items of int type.
The default value stored by this class is 0.

Autodesk.Revit.DB.CustomFieldValue.DoubleFieldValue
Identifies a computed value for the schedule items of double type.
The default value stored by this class is 0.0.

Autodesk.Revit.DB.CustomFieldValue.StringFieldValue
Identifies a computed value for the schedule items of string type.
The default value stored by this class is "".

Autodesk.Revit.DB.CustomFieldValue.#ctor
Constructs a new instance of a CustomFieldValue.

Autodesk.Revit.DB.CustomFieldValue
Class where can be set the computed value and the result of the computation.